In [13]:
import pandas as pd
import numpy as np

In [2]:
#last five olympics data: place, year and number of countries participated
olympic_data_list={'HostCity':['London', 'Beijing', 'Athens', 'Sydney', 'Atlanta'],
                  'Year': [2012, 2008, 2004, 2000, 1996],
                  'No.of countries': [205, 204, 201, 200, 197]}

In [3]:
df_olympic_data = pd.DataFrame(olympic_data_list)
df_olympic_data

  HostCity  No.of countries  Year
0   London              205  2012
1  Beijing              204  2008
2   Athens              201  2004
3   Sydney              200  2000
4  Atlanta              197  1996

In [4]:
#how to create a DataFrame from a series of dicts
olympic_data_dict = {'London': {2012:205}, 'Beijing': {2008:204}}

In [5]:
df_olympic_data_dict = pd.DataFrame(olympic_data_dict)

In [6]:
df_olympic_data_dict

      Beijing  London
2008    204.0     NaN
2012      NaN   205.0

In [7]:
#select by City name
df_olympic_data.HostCity

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: HostCity, dtype: object

In [8]:
#use describe function to display the content
df_olympic_data.describe

<bound method DataFrame.describe of   HostCity  No.of countries  Year
0   London              205  2012
1  Beijing              204  2008
2   Athens              201  2004
3   Sydney              200  2000
4  Atlanta              197  1996>

In [9]:
#Create DataFrame from dict of series
olympic_series_participation = pd.Series([205, 204, 201, 200, 197], index=[2012, 2008, 2004, 2000, 1996])
olympic_series_country = pd.Series(['London', 'Beijing', 'Athens', 'Sydney', 'Atlanta'], index=[2012, 2008, 2004, 2000, 1996])

In [10]:
df_olympic_series = pd.DataFrame({'No. of participating Countries': olympic_series_participation, 'Host Cities': olympic_series_country})

In [11]:
df_olympic_series

     Host Cities  No. of participating Countries
2012      London                             205
2008     Beijing                             204
2004      Athens                             201
2000      Sydney                             200
1996     Atlanta                             197

In [14]:
np_array = np.array([2012, 2008, 2004, 2006])
dict_ndarray = {'year': np_array}

In [16]:
df_ndarray = pd.DataFrame(dict_ndarray)
df_ndarray

   year
0  2012
1  2008
2  2004
3  2006

In [17]:
#create a dataFrame from a dataFrame
df_from_df = pd.DataFrame(df_olympic_series)

In [18]:
df_from_df

     Host Cities  No. of participating Countries
2012      London                             205
2008     Beijing                             204
2004      Athens                             201
2000      Sydney                             200
1996     Atlanta                             197